#include <stdio.h>
#include <time.h>
#include <conio.h>
#include <iostream>
#include <math.h>
#include <Windows.h>
#include <vector>
#include <cstdlib>

using namespace std;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	int variant;
		cout << "Выберите вариант\n" << endl;
		cout << "1. Страничное распределение памяти (страница - 1024 байт)\n"
			<< "2. Простое перечисление номеров кластеров файла (Кластер - 1024 байт)\n"
			<< "3. Выйти\n" << endl;
		cout << ">>> ";
		cin >> variant;

		switch (variant)
		{
		case 1:
			cout << "Страничное распределение памяти (страница - 1024 байт )... " << endl;
			{
				int PageSize, ROM, Process, s, s1, z, z1, y, y1, x, x1;
				int RAM = 5;
				int RAM1 = 5;
				int ROM1 = 100000;
				int PageSize1 = 1024;
				int o = 5;
				int o1 = 1536;
				const int n = 5;
				const int m = 5;
				int a[n] = { 3072, 5120, 1024, 512, 1024 };
				int b[m] = { 5120, 1024, 512, 1024, 1536 };
				ROM = 100000;
				PageSize = 1024;
				cout << "Размер страницы = " << PageSize << " байт" << endl;
				cout << "Кадров в оперативной памяти = " << RAM << endl;
				cout << "Страниц в виртуальной памяти = " << ROM << endl;
				cout << "     " << endl;
				for (int i = 0; i < n; i++)
				{
					cout << "----------------------------------------------- " << endl;
					cout << "   Размер процесса " << i << "  " << a[i] << endl;
					cout << "   " << endl;
					if (RAM > -1)
					{
						cout << "______________________ RAM ______________________" << endl;
						x = 1;
						cout << " Общиий объем кадров в операционной памяти = " << x * PageSize << " байт" << endl;
						cout << " Количество заянтых кадров данным процессом в оперативной памяти - " << x << endl;
						s = RAM - x;
						cout << " Количество свободных кадров в оператиной памяти - " << s << endl;
						RAM = s;
					}
					if (ROM >= (a[i] / PageSize));
					{
						cout << "   " << endl;
						cout << " ______________________ ROM ______________________" << endl;
						cout << " Общий объем страниц в виртуальной памяти - " << a[i]*PageSize << " байт" << endl;
						y = (a[i] / PageSize);
						cout << " Количество занятых страниц в вертуальной памяти - " << y << endl;
						z = ROM - y;
						cout << " Количество свободных страниц в виртуальной памяти - " << z << endl;
						ROM = z;
						cout << " Общее количество занятых страниц в виртуальной памяти - " << 100000 - z << endl;
					}
				}

				cout << "-------------------------------------------------------------" << endl;
				cout << "  Размер процесса " << o << "  " << o1 << endl;
				cout << "   " << endl;
				cout << " Мест в операционной памяти не хватает " << endl;
				y = (o1 / PageSize);
				cout << " Необходимо для процесса " << y << " страницы" << endl;
				x = 1;
				cout << " Необходимо в оперативной памяти" << x << " Кадр" << endl;
				for(int i = 0; i < 1; i++)
				{ 
					cout << "Удаляем первопришедший процесс под номером  " << i << ".... " << endl;
					cout << "   " << endl;
				}
					cout << " -----------------------------------------------------------------" << endl;
					cout << " Размер страницы = " << PageSize1 << " байт" << endl;
					cout << "  Кадров в оперативной памяти = " << RAM1 << endl;
					cout << " Страница в виртуальной памяти = " << ROM1 << endl;
					cout << "   " << endl;
					for (int i = 0; i < n; i++)
					{
						cout << "------------------------------------------------ " << endl;
						cout << " Размер процесса " << i << "  " << b[i] << endl;
						cout << "    " << endl;
						if (RAM1 >= 1)
						{
							cout << "_______________ RAM ________________________ " << endl;
							x1 = 1;
							cout << " Общий объем кадров в оперативной памяти - " << x1 * PageSize1 << " " << endl;
							cout << " Количество занятых кадров данным процессом в оперативной памяти - " << x1 << endl;
							s1 = RAM - x1;
							cout << " Количество свободных кадров в оперативной памяти - " << s1 << endl;
							RAM1 = s1;
						}
						if (ROM1 >= (b[i] / PageSize1));
							{
							cout << "    " << endl;
							cout << "  _______________ ROM ________________________" << endl;
							cout << " Общий объем страниц в виртульаной памяти " << b[i]*PageSize1 << endl;
							y1 = (b[i] / PageSize1);
							cout << " Количество занятых страниц в виртулаьной памяти - " << y1 << endl;
							z1 = ROM1 - y1;
							cout << " Количество свободных страниц в виртуальной памяти - " << z1 << endl;
							ROM1 = z1;
							cout << " Общее количество занятых страниц  в виртуальной памяти - " << 100000 - z1 << endl;
							}
						}

					_getch;
			}
		}
	}
